app/Services/AiSearchService.php

    public function findSimilar(Contact $contact, int $limit = 5): Collection
    {
        $embedding = DB::table('contact_embeddings')
            ->where('contact_id', $contact->id)
            ->where('type', 'full')
            ->value('embedding');
---
select "embedding" from "contact_embeddings" where "contact_id" = 9735 and "type" = 'full' limit 1