app/Services/TenantContext.php

    public static function initForUser(User $user): void
    {
        if (self::hasSession()) {
            $sessionOrgId = session('current_organization_id');
            if (is_numeric($sessionOrgId) && $user->belongsToOrganization((int) $sessionOrgId)) {
                $organization = Organization::query()->find($sessionOrgId);
---
select * from "organizations" where "organizations"."id" = 1 and "organizations"."deleted_at" is null limit 1