app/Http/Middleware/HandleInertiaRequests.php

            // Org overrides take precedence over global settings.
            $organization = TenantContext::get();
            if ($organization instanceof Organization) {
                $orgRows = DB::table('organization_settings')
                    ->where('organization_id', $organization->id)
                    ->where('group', 'theme')
                    ->get(['name', 'payload']);
---
select "name", "payload" from "organization_settings" where "organization_id" = 1 and "group" = 'branding' and "name" in ('user_can_change_colors', 'user_can_change_font', 'user_can_change_layout', 'user_can_change_logo')