app/Http/Middleware/ResolveDomainMiddleware.php

select * from "organization_domains" where "domain" = 'laravel-starter-kit-inertia-react.test' and "is_verified" = 1 limit 1
---
    public function handle(Request $request, Closure $next): Response
    {
        if (TenantContext::check()) {
            return $next($request);
        }

        $host = $request->getHost();

        $domain = OrganizationDomain::query()
            ->where('domain', $host)
            ->where('is_verified', true)
            ->with('organization')
            ->first();