app/Actions/GenerateAiSummaryAction.php

insert into "ai_summaries" ("summarizable_type", "summarizable_id", "content", "model", "created_at") values ('App\Models\Contact', 9735, 'Summary unavailable. Context: Qamar Saudagar | Type: lead | Stage: New', 'meta-llama/llama-3.3-70b-instruct:free', '2026-03-15 08:09:10') returning "id"
---
    public function handle(Model $model, string $context): AiSummary
    {
        $content = '';
        $usedModel = $this->prism->defaultModel();

        // Build richer context for contacts
        if ($model instanceof \App\Models\Contact) {
            $context = $this->buildContactContext($model, $context);
        }

        if ($this->prism->isAvailable()) {
            try {
                $response = $this->prism->text()
                    ->withSystemPrompt(
                        'You are a CRM assistant for a real estate investment platform. '
                        .'Generate a concise 2-3 sentence summary of this contact, focusing on: '
                        .'their engagement level, buying intent, key interests, and recommended next actions. '
                        .'Be specific and actionable.'
                    )
                    ->withPrompt($context)
                    ->generate();

                $content = $response->text;
            } catch (Throwable) {
                $content = $this->fallbackSummary($context);
            }
        } else {
            $content = $this->fallbackSummary($context);
        }

        return AiSummary::query()->create([
            'summarizable_type' => $model->getMorphClass(),
            'summarizable_id' => $model->getKey(),
            'content' => $content,
            'model' => $usedModel,
            'created_at' => now(),
        ]);

select * from "call_logs" where "call_logs"."contact_id" = 9735 and "call_logs"."contact_id" is not null order by "created_at" desc limit 5
---
    private function buildContactContext(\App\Models\Contact $contact, string $baseContext): string
    {
        $contact->loadMissing(['callLogs', 'tasks', 'propertySearches', 'strategyTags', 'emails', 'phones']);

        $parts = [$baseContext];

        // Recent activities
        $recentCalls = $contact->callLogs()->latest()->take(5)->get();