app/Actions/GetRequiredTermsVersionsForUser.php

select "terms_version_id" from "user_terms_acceptances" where "user_terms_acceptances"."user_id" = 1 and "user_terms_acceptances"."user_id" is not null
select * from "terms_versions" where "is_required" = 1 and 1 = 1 order by "effective_at" asc
---
    public function handle(User $user): Collection
    {
        $acceptedVersionIds = $user->termsAcceptances()->pluck('terms_version_id')->toArray();

        return TermsVersion::query()
            ->where('is_required', true)
            ->whereNotIn('id', $acceptedVersionIds)
            ->oldest('effective_at')
            ->get();