app/Actions/UpdateContactStageAction.php

    public function handle(Contact $contact, string $stage): void
    {
        $contact->stage = $stage;
        $contact->save();
---
update "contacts" set "stage" = 'new_lead', "updated_by" = 1, "updated_at" = '2026-03-15 12:21:11' where "id" = 9735