app/Listeners/LoginEventListener.php

insert into "login_events" ("user_id", "ip_address", "user_agent", "created_at") values (1, '127.0.0.1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', '2026-03-15 03:23:40') returning "id"
---
    public function handle(Login $event): void
    {
        LoginEvent::query()->create([
            'user_id' => $event->user->getAuthIdentifier(),
            'ip_address' => $this->request->ip(),
            'user_agent' => $this->request->userAgent(),
        ]);