app/DataTables/ProjectDataTable.php

    public static function tableAnalytics(): array
    {
        $query = self::tableBaseQuery();

        return [
            [
                'label' => 'Total Projects',
                'value' => $query->count(),
                'icon' => 'building-2',
                'color' => 'blue',
            ],
            [
                'label' => 'Available Lots',
                'value' => \App\Models\Lot::query()->where('title_status', 'available')->where('is_archived', false)->count(),
---
select count(*) as aggregate from "lots" where "title_status" = 'available' and "is_archived" = 0 and "lots"."deleted_at" is null