app/Http/Controllers/AdTemplateController.php

select count(*) as aggregate from "ad_templates" where ("organization_id" is null or "organization_id" is null) and "ad_templates"."deleted_at" is null
---
    public function index(): Response
    {
        $templates = AdTemplate::query()
            ->where(function ($q): void {
                $q->where('organization_id', tenant('id'))
                    ->orWhereNull('organization_id');
            })
            ->latest()
            ->paginate(15);