app/Http/Controllers/BrochureLayoutController.php

    public function index(): Response
    {
        $layouts = BrochureLayout::query()
            ->where(function ($q): void {
                $q->where('organization_id', tenant('id'))
                    ->orWhereNull('organization_id');
            })
            ->latest()
            ->paginate(15);

        $flyers = Flyer::query()
            ->with(['project', 'lot', 'flyerTemplate'])
            ->latest()
            ->limit(20)
            ->get();
---
select count(*) as aggregate from "brochure_layouts" where ("organization_id" is null or "organization_id" is null) and "brochure_layouts"."deleted_at" is null
select * from "flyers" where "flyers"."deleted_at" is null order by "created_at" desc limit 20