app/Http/Controllers/BuilderPortalController.php

    public function index(): Response
    {
        $orgId = auth()->user()?->currentOrganization?->id;

        $portals = BuilderPortal::query()
            ->when($orgId, fn ($q) => $q->where('organization_id', $orgId))
            ->orderByDesc('created_at')
            ->get();
---
select * from "builder_portals" where "builder_portals"."deleted_at" is null order by "created_at" desc