app/Http/Controllers/CampaignSiteController.php

select count(*) as aggregate from "campaign_websites" where "campaign_websites"."organization_id" is null and "campaign_websites"."deleted_at" is null
---
    public function index(Request $request): Response
    {
        $orgId = TenantContext::id();

        $sites = CampaignWebsite::query()
            ->when($orgId, fn ($q) => $q->where('organization_id', $orgId))
            ->orderByDesc('created_at')
            ->paginate(20);