app/Http/Controllers/ContactController.php

    public function show(int $contact): Response
    {
        $contact = Contact::query()->findOrFail($contact);

        $contact->load([
            'emails',
            'phones',
            'company',
            'source',
            'assignedUser:id,name,email',
            'tasks' => fn ($q) => $q->orderByDesc('created_at')->limit(10),
            'callLogs' => fn ($q) => $q->orderByDesc('called_at')->limit(10),
            'strategyTags',
            'aiSummaries' => fn ($q) => $q->latest()->limit(1),
            'propertySearches' => fn ($q) => $q->latest()->limit(5),
        ]);
---
select "strategy_tags".*, "contact_strategy_tag"."contact_id" as "pivot_contact_id", "contact_strategy_tag"."strategy_tag_id" as "pivot_strategy_tag_id", "contact_strategy_tag"."created_at" as "pivot_created_at" from "strategy_tags" inner join "contact_strategy_tag" on "strategy_tags"."id" = "contact_strategy_tag"."strategy_tag_id" where "contact_strategy_tag"."contact_id" in (9735)
select * from "sources" where "sources"."id" in (15)