app/Http/Controllers/DashboardController.php

select count(*) as aggregate from "tasks" where "due_at" < '2026-03-15 04:38:06' and "status" != 'done' and "tasks"."organization_id" is null and "tasks"."deleted_at" is null
---
    private function crmKpis(?int $agentId): array
    {
        $weekAgo = Date::now()->subDays(7);

        $newContacts = Contact::query()->where('created_at', '>=', $weekAgo)->count();
        $newContactsLast = Contact::query()
            ->whereBetween('created_at', [Date::now()->subDays(14), $weekAgo])
            ->count();
        $newContactsDelta = $newContactsLast > 0
            ? (int) round(($newContacts - $newContactsLast) / $newContactsLast * 100)
            : ($newContacts > 0 ? 100 : 0);

        $activeReservations = PropertyReservation::query()
            ->whereNotIn('stage', ['settled', 'cancelled'])
            ->count();

        $settledThisMonth = '$'.number_format(
            (float) Sale::query()
                ->where('status', 'settled')
                ->where('settled_at', '>=', Date::now()->startOfMonth())
                ->sum('comms_in_total'),
            0
        );

        $tasksQuery = Task::query()
            ->where('due_at', '<', Date::now())
            ->where('status', '!=', 'done');
        if ($agentId !== null) {
            $tasksQuery->where('assigned_to_user_id', $agentId);
        }
        $overdueTasksCount = $tasksQuery->count();

select stage, COUNT(*) as count from "property_reservations" where "property_reservations"."deleted_at" is null group by "stage"
---
    private function pipelineFunnel(?int $agentId): array
    {
        $stages = ['enquiry', 'qualified', 'reservation', 'unconditional', 'contract', 'settled'];
        $query = PropertyReservation::query();

        $counts = $query
            ->selectRaw('stage, COUNT(*) as count')
            ->groupBy('stage')
            ->pluck('count', 'stage');

select count(*) as aggregate from "users" where "created_at" between '2026-03-09 00:00:00' and '2026-03-15 04:38:06' and "users"."deleted_at" is null
select DATE(created_at) as date, COUNT(*) as count from "users" where "created_at" >= '2026-03-09 00:00:00' and "users"."deleted_at" is null group by "date"
---
    private function weeklyStats(): array
    {
        $days = collect(range(6, 0))->map(fn (int $i) => Date::today()->subDays($i));

        $signups = User::query()
            ->selectRaw('DATE(created_at) as date, COUNT(*) as count')
            ->where('created_at', '>=', $days->first())
            ->groupBy('date')
            ->pluck('count', 'date');