app/Http/Controllers/DashboardController.php

select count(*) as aggregate from "users" where "users"."deleted_at" is null
select count(*) as aggregate from "organizations" where "organizations"."deleted_at" is null
---
    public function __invoke(Request $request): Response
    {
        $user = $request->user();
        $isSuperAdmin = $user->hasRole('super-admin');
        $isAdmin = $user->hasRole('admin') || $user->hasRole('piab_admin');
        $isAgent = $user->hasRole('agent') || $user->hasRole('sales_agent') || $user->hasRole('bdm');

        $props = [];

        // CRM KPIs (available to all CRM roles)
        if ($isSuperAdmin || $isAdmin || $isAgent) {
            $agentId = ($isAgent && ! $isAdmin && ! $isSuperAdmin) ? $user->id : null;

            $props['crmKpis'] = Inertia::defer(fn () => $this->crmKpis($agentId));
            $props['pipelineFunnel'] = Inertia::defer(fn () => $this->pipelineFunnel($agentId));
            $props['aiInsight'] = Cache::get('dashboard_insight');
            $props['featuredProjects'] = Inertia::defer(fn () => $this->featuredProjects());
        }

        if ($isSuperAdmin) {
            $props['usersCount'] = User::query()->count();
            $props['orgsCount'] = Organization::query()->count();

select count(*) as aggregate from "property_reservations" where "stage" not in ('settled', 'cancelled') and "property_reservations"."deleted_at" is null
select sum("comms_in_total") as aggregate from "sales" where "status" = 'settled' and "settled_at" >= '2026-03-01 00:00:00' and "sales"."deleted_at" is null
select count(*) as aggregate from "tasks" where "due_at" < '2026-03-15 05:33:42' and "status" != 'done' and "tasks"."organization_id" is null and "tasks"."deleted_at" is null
---
    private function crmKpis(?int $agentId): array
    {
        $weekAgo = Date::now()->subDays(7);

        $newContacts = Contact::query()->where('created_at', '>=', $weekAgo)->count();
        $newContactsLast = Contact::query()
            ->whereBetween('created_at', [Date::now()->subDays(14), $weekAgo])
            ->count();
        $newContactsDelta = $newContactsLast > 0
            ? (int) round(($newContacts - $newContactsLast) / $newContactsLast * 100)
            : ($newContacts > 0 ? 100 : 0);

        $activeReservations = PropertyReservation::query()
            ->whereNotIn('stage', ['settled', 'cancelled'])
            ->count();

        $settledThisMonth = '$'.number_format(
            (float) Sale::query()
                ->where('status', 'settled')
                ->where('settled_at', '>=', Date::now()->startOfMonth())
                ->sum('comms_in_total'),
            0
        );

        $tasksQuery = Task::query()
            ->where('due_at', '<', Date::now())
            ->where('status', '!=', 'done');
        if ($agentId !== null) {
            $tasksQuery->where('assigned_to_user_id', $agentId);
        }
        $overdueTasksCount = $tasksQuery->count();

select count(*) as aggregate from "lots" where "is_archived" = 0 and "lots"."deleted_at" is null
select count(*) as aggregate from "lots" where "is_archived" = 1 and "lots"."deleted_at" is null
---
            'overdueTasksCount' => $overdueTasksCount,
            'staleContacts' => $staleContacts,
            'totalContacts' => $totalContacts,
            'totalLotsAvailable' => Lot::query()->where('is_archived', false)->count(),
            'totalLotsSold' => Lot::query()->where('is_archived', true)->count(),

select stage, COUNT(*) as count from "property_reservations" where "property_reservations"."deleted_at" is null group by "stage"
---
    private function pipelineFunnel(?int $agentId): array
    {
        $stages = ['enquiry', 'qualified', 'reservation', 'unconditional', 'contract', 'settled'];
        $query = PropertyReservation::query();

        $counts = $query
            ->selectRaw('stage, COUNT(*) as count')
            ->groupBy('stage')
            ->pluck('count', 'stage');

select count(*) as aggregate from "users" where "created_at" between '2026-03-02 00:00:00' and '2026-03-08 23:59:59' and "users"."deleted_at" is null
select DATE(created_at) as date, COUNT(*) as count from "users" where "created_at" >= '2026-03-09 00:00:00' and "users"."deleted_at" is null group by "date"
---
    private function weeklyStats(): array
    {
        $days = collect(range(6, 0))->map(fn (int $i) => Date::today()->subDays($i));

        $signups = User::query()
            ->selectRaw('DATE(created_at) as date, COUNT(*) as count')
            ->where('created_at', '>=', $days->first())
            ->groupBy('date')
            ->pluck('count', 'date');