app/Http/Controllers/ReportController.php

    private function reservationsReport(Request $request): Response
    {
        $byStage = PropertyReservation::query()
            ->selectRaw('stage, COUNT(*) as count')
            ->groupBy('stage')
            ->pluck('count', 'stage')
            ->toArray();
---
select stage, COUNT(*) as count from "property_reservations" where "property_reservations"."deleted_at" is null group by "stage"

    private function commissionsReport(Request $request): Response
    {
        $byType = Commission::query()
            ->selectRaw('commission_type, SUM(amount) as total')
            ->groupBy('commission_type')
            ->pluck('total', 'commission_type')
            ->toArray();
---
select commission_type, SUM(amount) as total from "commissions" where "commissions"."deleted_at" is null group by "commission_type"

    private function loginHistoryReport(Request $request): Response
    {
        $byDay = LoginEvent::query()
            ->selectRaw('DATE(created_at) as date, COUNT(*) as count')
            ->where('created_at', '>=', now()->subDays(30))
            ->groupBy('date')
            ->orderBy('date')
            ->pluck('count', 'date')
            ->toArray();
---
select DATE(created_at) as date, COUNT(*) as count from "login_events" where "created_at" >= '2026-02-13 03:34:07' group by "date" order by "date" asc

    private function sameDeviceReport(Request $request): Response
    {
        // Find device fingerprints shared by 2+ distinct users within 30 days
        $sharedDevices = LoginEvent::query()
            ->selectRaw('device_fingerprint, COUNT(DISTINCT user_id) as user_count, COUNT(*) as login_count, MAX(created_at) as last_seen')
            ->whereNotNull('device_fingerprint')
            ->where('created_at', '>=', now()->subDays(30))
            ->groupBy('device_fingerprint')
            ->having('user_count', '>=', 2)
            ->orderByDesc('user_count')
            ->get()
            ->map(fn ($row) => [
                'fingerprint_masked' => mb_substr((string) $row->device_fingerprint, 0, 8).'...',
                'user_count' => $row->user_count,
                'login_count' => $row->login_count,
                'last_seen' => $row->last_seen,
            ])
            ->toArray();
---
select device_fingerprint, COUNT(DISTINCT user_id) as user_count, COUNT(*) as login_count, MAX(created_at) as last_seen from "login_events" where "device_fingerprint" is not null and "created_at" >= '2026-02-13 03:34:35' group by "device_fingerprint" having COUNT(DISTINCT user_id) >= 2 order by COUNT(DISTINCT user_id) DESC