app/Models/User.php

    public function defaultOrganization(): ?Organization
    {
        return $this->organizations()->wherePivot('is_default', true)->first();
---
select "organizations".*, "organization_user"."user_id" as "pivot_user_id", "organization_user"."organization_id" as "pivot_organization_id", "organization_user"."is_default" as "pivot_is_default", "organization_user"."joined_at" as "pivot_joined_at", "organization_user"."invited_by" as "pivot_invited_by", "organization_user"."created_at" as "pivot_created_at", "organization_user"."updated_at" as "pivot_updated_at" from "organizations" inner join "organization_user" on "organizations"."id" = "organization_user"."organization_id" where "organization_user"."user_id" = 1 and "organization_user"."is_default" = 1 and "organizations"."deleted_at" is null limit 1

    public function belongsToOrganization(int $organizationId): bool
    {
        return $this->organizations()->where('organizations.id', $organizationId)->exists();
---
select exists(select * from "organizations" inner join "organization_user" on "organizations"."id" = "organization_user"."organization_id" where "organization_user"."user_id" = 1 and "organizations"."id" = 1 and "organizations"."deleted_at" is null) as "exists"